update post: Kubernetes Pods
